#include "stdoscp.bas"

/* 最初と最後が0に成らなければ異常
 */

dim a = 0;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1; a = a - 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);

a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1; a = a + 0.1;
__print(a);
